Revit 2020 API
CylindricalFace Properties
The CylindricalFace type exposes the following members.
Properties
Name | Description
Area
The area of this face.
 (Inherited from Face.)
Axis
Axis of the surface.
EdgeLoops
A collection of edge loops. Each edge loop represents one of the closed boundaries of the face.
 (Inherited from Face.)
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
HasRegions
Identifies if the face contains regions (which can be created, for example, by the Split Face command).
 (Inherited from Face.)
IsCyclic
Indicates whether the underlying surface is periodic in the specified parametric direction.
 (Inherited from Face.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsTwoSided
Determines if a face is two-sided (degenerate).
 (Inherited from Face.)
MaterialElementId
The element ID of the material from which this face is composed.
 (Inherited from Face.)
OrientationMatchesSurfaceOrientation
 Returns true if this face's orientation matches the orientation of the face's surface, false if they have opposite orientations.
 (Inherited from Face.)
Origin
Origin of the surface.
Period
The period of the underlying surface in the specified parametric direction.
 (Inherited from Face.)
Radius
Radii of the surface.
Reference
Returns a stable reference to the face.
 (Inherited from Face.)
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
CylindricalFace Class
Autodesk.Revit.DB Namespace